{
	"stateDataFile": [
		{
			"slug": "gujarat",
			"title": "ગુજરાત",
			"sub": "Gujarāta",
			"videoSrc": "https://www.youtube.com/embed/QjXlGqLQWNc?si=_r6BLmo8p_ZhNKDV",
			"description": "Explore the vibrant culture, rich history, and delicious cuisine of Gujarat. Discover its beautiful landscapes and warm hospitality.",
			"cards": [
				{
					"image": "/stateculture/garba.jpg",
					"badge": "festival",
					"desc": "Navratri is a significant festival celebrated in Gujarat, dedicated to the worship of the goddess Durga. It lasts for nine nights, filled with vibrant dance and music. Garba and Dandiya Raas are traditional dances performed during this time. People dress in colorful attire and gather in large groups to celebrate. The festival symbolizes the victory of good over evil."
				},
				{
					"image": "/stateculture/raas.jpg",
					"badge": "music",
					"desc": "Gujarat's vibrant music scene is characterized by folk music forms like Garba, Dandiya Raas, Bhavai, and Dhamaal. These traditional styles are often performed during festivals like Navratri, featuring energetic dances and devotional songs. The music is typically accompanied by instruments such as the dhol, manjira, and harmonium, creating a captivating soundscape that reflects the state's rich cultural heritage."
				},
				{
					"image": "/stateculture/dhokla.jpg",
					"badge": "cuisine",
					"desc": "Gujarat's cuisine is a delightful blend of flavors, with a strong emphasis on vegetarian dishes. Popular dishes include Thepla (a flatbread made with wheat flour and various spices), Dhokla (a savory snack made from fermented batter), Khandvi (a savory snack made from gram flour), and Undhiyu (a mixed vegetable dish cooked in a clay pot). Gujarati cuisine also offers a variety of sweet treats like Basundi (a rich, creamy milk-based dessert) and Doodhpak (a milk pudding)."
				}
			]
		}, 
		{
			"slug": "maharashtra",
			"title": "महाराष्ट्र",
			"sub": "Mahārāṣṭra",
			"videoSrc": "https://www.youtube.com/embed/-6EdcEFX_Uk?si=FG-riHVWbdNdj2tg",
			"description": "Discover the diverse cultural heritage of Maharashtra, from its bustling cities to rich traditions, vibrant festivals, and delectable cuisine.",
			"cards": [
				{
					"image": "/stateculture/ganesh.jpg",
					"badge": "festival",
					"desc": "Ganesh Chaturthi is the most significant festival in Maharashtra, celebrating the birth of Lord Ganesha. The festival typically lasts 10 days, with elaborate public celebrations, massive idols, and immersion processions. People create intricate Ganesh sculptures, decorate their homes, and participate in community festivities that showcase the state's cultural unity and devotion."
				},
				{
					"image": "/stateculture/lavani.jpg",
					"badge": "traditional dance and music",
					"desc": "Maharashtra's musical tradition is rich with folk forms like Lavani, a powerful combination of music and dance. Characterized by fast-paced rhythms and expressive movements, Lavani often depicts social themes and tells stories through performance. Other musical styles include Gondhal, a devotional performance, and Powada, which narrates historical events and heroic tales."
				},
				{
					"image": "/stateculture/vadapav.jpg",
					"badge": "cuisine",
					"desc": "Maharashtrian cuisine is diverse and flavorful, known for its spicy and tangy dishes. Signature items include Vada Pav (a popular street food of spiced potato fritter in a bun), Puran Poli (a sweet flatbread), Misal Pav (a spicy sprouts curry), and Modak (a sweet dumpling especially popular during Ganesh Chaturthi). The cuisine blends influences from coastal, inland, and urban cooking styles."
				}
			]
		}, 
		{
			"slug": "karnataka",
			"title": "ಕರ್ನಾಟಕ",
			"sub": "Karnāṭaka",
			"videoSrc": "https://www.youtube.com/embed/ZAjd9Lh1-lA?si=Vmwwepr188niTIuZ",
			"description": "Experience the rich cultural tapestry of Karnataka, known for its historical heritage, classical arts, and diverse culinary traditions.",
			"cards": [
				{
					"image": "/stateculture/karaga.jpg",
					"badge": "festival",
					"desc": "Karaga is a unique and ancient festival celebrated in Bangalore, primarily at the Dharmaraya Swamy Temple. This nine-day festival honors Draupadi and is marked by a spectacular night procession where a priest carries a decorated pot symbolizing feminine energy. The festival showcases intricate rituals, traditional music, and community participation."
				},
				{
					"image": "/stateculture/yakshagana.jpg",
					"badge": "Theatre, Dance & Music",
					"desc": "Yakshagana is Karnataka's traditional theatre form, combining dance, music, elaborate costumes, and storytelling. Performers narrate mythological stories through vibrant performances, accompanied by traditional instruments like the harmonium, mridangam, and chenda. Classical music forms like Carnatic music also play a significant role in Karnataka's rich musical heritage."
				},
				{
					"image": "/stateculture/bisi-bele-bath.jpg",
					"badge": "cuisine",
					"desc": "Karnataka's cuisine is diverse, ranging from coastal seafood to vegetarian delicacies. Signature dishes include Bisi Bele Bath (a spicy rice dish), Masala Dosa, Mysore Pak (a sweet delicacy), and Kundapura Chicken. The cuisine varies across regions, with influences from Mysore, Mangalore, and Udupi styles, offering a wide range of flavors and cooking techniques."
				}
			]
		}, 
		{
			"slug": "west-bengal",
			"title": "পশ্চিমবঙ্গ",
			"sub": "Paścim Baṅga",
			"videoSrc": "https://www.youtube.com/embed/6CjwVHGlXho?si=oa1jT63B8ITFhvFV",
			"description": "Explore the cultural richness of West Bengal, known for its intellectual heritage, artistic traditions, and mouth-watering cuisine.",
			"cards": [
				{
					"image": "/stateculture/durga-puja.jpg",
					"badge": "festival",
					"desc": "Durga Puja is the most significant festival in West Bengal, celebrating the goddess Durga's victory over evil. The festival transforms cities and villages into vibrant art galleries, with elaborate pandals (temporary structures), intricate idol installations, and community celebrations. It's a time of cultural expression, artistic creativity, and social bonding."
				},
				{
					"image": "/stateculture/baul.jpg",
					"badge": "music",
					"desc": "Baul music is a unique folk music tradition of West Bengal, representing a mystical musical genre that blends spiritual and philosophical expressions. Baul singers, known as wandering minstrels, use traditional instruments like the ektara and perform soul-stirring songs that explore human emotions and spiritual connections."
				},
				{
					"image": "/stateculture/rosogulla.jpg",
					"badge": "cuisine",
					"desc": "Bengali cuisine is renowned for its subtle flavors and diverse preparations. Signature dishes include Rosogulla (a sweet cheese ball), Macher Jhol (fish curry), Kosha Mangsho (spicy dry mutton), and Mishti Doi (sweet yogurt). The cuisine is characterized by its use of mustard oil, fish, rice, and a balance of sweet and spicy flavors that reflect the region's culinary sophistication."
				}
			]
		}, 
		{
			"slug": "rajasthan",
			"title": "राजस्थान",
			"sub": "Rājasthān",
			"videoSrc": "https://www.youtube.com/embed/O5DT3-nn0-8?si=SlsJ1gLbM_LU7O7B",
			"description": "Discover the royal and vibrant culture of Rajasthan, known for its colorful traditions, desert landscapes, and rich cultural heritage.",
			"cards": [
				{
					"image": "/stateculture/teej.jpg",
					"badge": "festival",
					"desc": "Teej is a monsoon festival celebrated with great enthusiasm in Rajasthan. Women dress in colorful traditional attire, apply mehendi (henna), and participate in folk dances and songs. The festival celebrates the onset of monsoon, marital harmony, and the goddess Parvati. Processions, swings, and traditional celebrations mark this vibrant festival."
				},
				{
					"image": "/stateculture/kalbeliya.jpg",
					"badge": "music",
					"desc": "Rajasthani folk music is world-renowned, with Kalbeliya being a distinctive dance and music form. Traditionally performed by the Kalbeliya community, it features serpentine movements and is accompanied by instruments like the been (wind instrument) and dholak. Other notable music forms include Maand, a classical folk style, and Pabuji ki Phach, an epic narrative performance."
				},
				{
					"image": "/stateculture/dal-baati-churma.jpg",
					"badge": "cuisine",
					"desc": "Rajasthani cuisine is known for its robust flavors and unique preparations adapted to the desert environment. Dal Baati Churma is the state's most famous dish, consisting of lentils, baked wheat balls, and a sweet powdered mixture. Other specialties include Gatte ki Sabzi, Ker Sangri, and Laal Maas (a spicy mutton curry). The cuisine is characterized by its use of dried ingredients and rich, spicy flavors."
				}
			]
		},
		{
			"slug": "kerala",
			"title": "കേരളം",
			"sub": "Kēraḷam",
			"videoSrc": "https://www.youtube.com/embed/P3vwzNYIL_U?si=xyz123",
			"description": "Experience the serene beauty of Kerala, known for its backwaters, lush greenery, classical art forms, and rich cultural traditions that blend multiple influences.",
			"cards": [
			  {
				"image": "/stateculture/onam.jpg",
				"badge": "festival",
				"desc": "Onam is Kerala's grand harvest festival celebrated with great pomp and show. The festivities include creating intricate flower carpets (pookalam), boat races (vallam kali), traditional dance performances, and an elaborate feast called Onasadya. The festival commemorates the mythical King Mahabali and showcases Kerala's cultural unity."
			  },
			  {
				"image": "/stateculture/kathakali.jpg",
				"badge": "music",
				"desc": "Kathakali is Kerala's iconic classical dance-drama known for its elaborate makeup, costumes, and hand gestures. The art form combines dance, music, and acting to narrate stories from epics. Other significant performing arts include Mohiniyattam (classical dance), Theyyam (ritual art form), and Poorakkali (folk dance)."
			  },
			  {
				"image": "/stateculture/sadhya.jpg",
				"badge": "cuisine",
				"desc": "Kerala cuisine is distinguished by its use of coconut, spices, and fresh seafood. The traditional Kerala Sadhya, served on a banana leaf, includes various vegetarian dishes with rice. Popular dishes include Karimeen Pollichathu (pearl spot fish), Appam with Stew, and Puttu with Kadala Curry. The cuisine is known for its balanced flavors and health-conscious cooking methods."
			  }
			]
		},
		  
		{
			"slug": "punjab",
			"title": "ਪੰਜਾਬ",
			"sub": "Pañjāb",
			"videoSrc": "https://www.youtube.com/embed/K5G5z2uB6ZQ?si=abc456",
			"description": "Explore the vibrant spirit of Punjab, a land known for its energetic culture, agricultural heritage, warm hospitality, and rich traditions of music and dance.",
			"cards": [
			  {
				"image": "/stateculture/baisakhi.jpg",
				"badge": "festival",
				"desc": "Baisakhi is Punjab's major harvest festival and marks the Sikh New Year. The celebration features vibrant Bhangra and Giddha performances, community gatherings at Gurudwaras, and festive processions called Nagar Kirtan. The festival also commemorates the formation of the Khalsa Panth by Guru Gobind Singh."
			  },
			  {
				"image": "/stateculture/bhangra.jpg",
				"badge": "music",
				"desc": "Bhangra is Punjab's energetic folk dance and music form, originally performed to celebrate the harvest season. It features dynamic movements, dhol drums, and spirited lyrics. The musical tradition also includes Giddha (women's dance form), Tumbi (string instrument) playing, and various forms of folk singing like Jugni and Mahiya."
			  },
			  {
				"image": "/stateculture/makki-sarson.jpg",
				"badge": "cuisine",
				"desc": "Punjabi cuisine is renowned for its rich, hearty flavors and generous use of dairy products. Signature dishes include Makki di Roti with Sarson da Saag, Butter Chicken, and various tandoor preparations. The cuisine features abundant use of ghee, butter, and cream, with specialties like Amritsari Fish, Dal Makhani, and a variety of stuffed parathas."
			  }
			]
		}, 
		{
			"slug": "tamil-nadu",
			"title": "தமிழ்நாடு",
			"sub": "Tamiḻ Nāḍu",
			"videoSrc": "https://www.youtube.com/embed/L8GPvNt7X8k?si=def789",
			"description": "Immerse yourself in Tamil Nadu's ancient culture, classical arts, magnificent temples, and traditions that have survived through millennia.",
			"cards": [
			  {
				"image": "/stateculture/pongal.jpg",
				"badge": "festival",
				"desc": "Pongal is Tamil Nadu's four-day harvest festival celebrating the sun god and agriculture. Each day has specific rituals and celebrations, including cooking the traditional Pongal dish, cattle worship (Mattu Pongal), and community gatherings. The festival showcases Tamil traditions of gratitude and community bonding."
			  },
			  {
				"image": "/stateculture/bharatanatyam.jpg",
				"badge": "music",
				"desc": "Bharatanatyam is Tamil Nadu's classical dance form known for its grace, precision, and spiritual expression. The Carnatic music tradition features complex rhythms and melodic structures. Other significant art forms include Thevaram (devotional songs), Villupattu (bow song), and various temple music traditions."
			  },
			  {
				"image": "/stateculture/thali.jpg",
				"badge": "cuisine",
				"desc": "Tamil cuisine is known for its use of rice, lentils, and distinct spice blends. The traditional Tamil meal served on banana leaf includes various preparations of vegetables, sambhar, rasam, and chutneys. Famous dishes include Dosa, Idli, Pongal, and Chettinad specialties. The cuisine emphasizes balanced flavors and traditional cooking methods."
			  }
			]
		}, 
		{
			"slug": "assam",
			"title": "অসম",
			"sub": "Axom",
			"videoSrc": "https://www.youtube.com/embed/R8HN3FWd_Ck?si=ghi012",
			"description": "Discover Assam's unique blend of diverse cultures, tea traditions, wildlife, and rich heritage of music, dance, and festivals.",
			"cards": [
			  {
				"image": "/stateculture/bihu.jpg",
				"badge": "festival",
				"desc": "Bihu is Assam's major harvest festival celebrated three times a year, with Bohag Bihu being the most prominent. The festivities include Bihu dance performances, traditional games, community feasts, and cultural programs. Each Bihu marks different agricultural seasons and showcases Assamese customs and traditions."
			  },
			  {
				"image": "/stateculture/sattriya.jpg",
				"badge": "music",
				"desc": "Sattriya is Assam's classical dance form that originated in Vaishnava monasteries. The musical tradition includes Borgeet (devotional songs), Bihu folk songs, and various tribal music forms. Traditional instruments like dhol, pepa, and gagana enhance the rich musical heritage of the region."
			  },
			  {
				"image": "/stateculture/assamese-thali.jpg",
				"badge": "cuisine",
				"desc": "Assamese cuisine is characterized by minimal spices and fresh herbs, with fermented foods being a unique aspect. Traditional dishes include Masor Tenga (sour fish curry), Khar (alkaline preparation), and various bamboo shoot preparations. The cuisine features distinctive ingredients like banana flowers, taro, and various local herbs and vegetables."
			  }
			]
		  }
	]
}